Started at Thu Nov 16 15:35:13 2023

***	ft_isalpha()	***
arg=65, result=1, expected=1.
...	TEST [1] OK	...
arg=97, result=1, expected=1.
...	TEST [2] OK	...
arg=52, result=0, expected=0.
...	TEST [3] OK	...
arg=0, result=0, expected=0.
...	TEST [4] OK	...
arg=46, result=0, expected=0.
...	TEST [5] OK	...
arg=122, result=1, expected=1.
...	TEST [6] OK	...

***	ft_isdigit()	***
arg=48, result=1, expected=1.
...	TEST [1] OK	...
arg=97, result=0, expected=0.
...	TEST [2] OK	...
arg=52, result=1, expected=1.
...	TEST [3] OK	...
arg=0, result=0, expected=0.
...	TEST [4] OK	...
arg=46, result=0, expected=0.
...	TEST [5] OK	...
arg=122, result=0, expected=0.
...	TEST [6] OK	...
arg=57, result=1, expected=1.
...	TEST [7] OK	...

***	ft_isalnum()	***
arg=48, result=1, expected=1.
...	TEST [1] OK	...
arg=97, result=1, expected=1.
...	TEST [2] OK	...
arg=52, result=1, expected=1.
...	TEST [3] OK	...
arg=0, result=0, expected=0.
...	TEST [4] OK	...
arg=46, result=0, expected=0.
...	TEST [5] OK	...
arg=122, result=1, expected=1.
...	TEST [6] OK	...
arg=57, result=1, expected=1.
...	TEST [7] OK	...

***	ft_isascii()	***
arg=48, result=1, expected=1.
...	TEST [1] OK	...
arg=97, result=1, expected=1.
...	TEST [2] OK	...
arg=123, result=1, expected=1.
...	TEST [3] OK	...
arg=0, result=1, expected=1.
...	TEST [4] OK	...
arg=37, result=1, expected=1.
...	TEST [5] OK	...

***	ft_isprint()	***
arg=48, result=1, expected=1.
...	TEST [1] OK	...
arg=97, result=1, expected=1.
...	TEST [2] OK	...

...	TEST [6] OK	...
...	TEST [7] OK	...
...	TEST [8] OK	...

***	ft_strrchr()	***
...	TEST [1] OK	...
...	TEST [2] OK	...
...	TEST [3] OK	...
...	TEST [4] OK	...
...	TEST [5] OK	...
...	TEST [6] OK	...
...	TEST [7] OK	...
...	TEST [8] OK	...

***	ft_strncmp()	***
ft_result = 0
std_result = 0
...	TEST [1] OK	...
ft_result = 0
std_result = 0
...	TEST [2] OK	...
ft_result = 38
std_result = 1
...	TEST [3] OK	...
ft_result = 0
std_result = 0
...	TEST [4] OK	...
ft_result = 0
std_result = 0
...	TEST [5] OK	...
ft_result = -68
std_result = -1
...	TEST [6] OK	...
ft_result = 82
std_result = 1
...	TEST [7] OK	...
ft_result = 0
std_result = 0
...	TEST [8] OK	...

***	ft_memchr()	***
...	TEST [1] OK	...
...	TEST [2] OK	...
...	TEST [3] OK	...
...	TEST [4] OK	...
...	TEST [5] OK	...

***	ft_memcmp()	***
ft_memcmp([q50FW4QZfB4hjU], [q50FW4QAfB4hjU], 12) == 25
memcmp([q50FW4QZfB4hjU], [q50FW4QAfB4hjU], 12) == 25
...	TEST [1] OK	...
ft_memcmp([q50FW4Q1fB4hjU], [q50FW4Q1fB4hjU], 0) == 0
memcmp([q50FW4Q1fB4hjU], [q50FW4Q1fB4hjU], 0) == 0
...	TEST [2] OK	...
ft_memcmp([q50Fw4Q1fB4hjU], [q50FW4Q1fB4hjZ], 12) == 32
memcmp([q50Fw4Q1fB4hjU], [q50FW4Q1fB4hjZ], 12) == 32
...	TEST [3] OK	...
ft_memcmp([q50FW4Q1fB4hjU], [q50FW4Q1fB4hjZ], 14) == -5
memcmp([q50FW4Q1fB4hjU], [q50FW4Q1fB4hjZ], 14) == -5
...	TEST [4] OK	...
ft_memcmp([q50FW4Q1fB4hjU], [q50FW4Q1fB4hjU], 24) == 0
memcmp([q50FW4Q1fB4hjU], [q50FW4Q1fB4hjU], 24) == 0
...	TEST [5] OK	...
ft_memcmp([90], [], 9) == 56
memcmp([90], [], 9) == 56
...	TEST [6] OK	...
ft_memcmp([], [], 5) == 0
memcmp([], [], 5) == 0
...	TEST [7] OK	...
ft_memcmp([], [], 8) == -198
memcmp([], [], 8) == -198
...	TEST [8] OK	...
ft_memcmp([], [], 9) == 0
memcmp([], [], 9) == 0
...	TEST [9] OK	...
ft_memcmp([], [], 2) == 0
memcmp([], [], 2) == 0
...	TEST [10] OK	...
ft_memcmp([], [], 0) == 0
memcmp([], [], 0) == 0
...	TEST [11] OK	...

***	ft_strnstr()	***
ft_strnstr=[ sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut ]
strnstr=[ sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut ]
...	TEST [1] OK	...
ft_strnstr=[ , sed diam nonumy eirmod tempor invidunt ut ]
strnstr=[ , sed diam nonumy eirmod tempor invidunt ut ]
...	TEST [2] OK	...
ft_strnstr=[ (null) ]
strnstr=[ (null) ]
...	TEST [3] OK	...
ft_strnstr=[  ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut ]
strnstr=[  ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut ]
...	TEST [4] OK	...
ft_strnstr=[ Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut ]
strnstr=[ Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut ]
...	TEST [5] OK	...
ft_strnstr=[ (null) ]
strnstr=[ (null) ]
...	TEST [6] OK	...
ft_strnstr=[ (null) ]
strnstr=[ (null) ]
...	TEST [7] OK	...

***	ft_calloc()	***
- - - -
int
ft[ptr]=0x1fff0000f8 | std(ptr)=0x1fff0000f0
nmemb=5
size=4
ft[sizeof=1, pointer=0x4ac0c90] | std(sizeof=1, pointer=0x4ac0cf0)
ft[sizeof=1, pointer=0x4ac0c91] | std(sizeof=1, pointer=0x4ac0cf1)
ft[sizeof=1, pointer=0x4ac0c92] | std(sizeof=1, pointer=0x4ac0cf2)
ft[sizeof=1, pointer=0x4ac0c93] | std(sizeof=1, pointer=0x4ac0cf3)
ft[sizeof=1, pointer=0x4ac0c94] | std(sizeof=1, pointer=0x4ac0cf4)
- - - -
char
ft[ptr]=0x1fff0000f8 | std(ptr)=0x1fff0000f0
nmemb=5
size=1
ft[sizeof=1, pointer=0x4ac0d50] | std(sizeof=1, pointer=0x4ac0da0)
ft[sizeof=1, pointer=0x4ac0d51] | std(sizeof=1, pointer=0x4ac0da1)
ft[sizeof=1, pointer=0x4ac0d52] | std(sizeof=1, pointer=0x4ac0da2)
ft[sizeof=1, pointer=0x4ac0d53] | std(sizeof=1, pointer=0x4ac0da3)
ft[sizeof=1, pointer=0x4ac0d54] | std(sizeof=1, pointer=0x4ac0da4)
- - - -
short
ft[ptr]=0x1fff0000f8 | std(ptr)=0x1fff0000f0
nmemb=5
size=2
ft[sizeof=1, pointer=0x4ac0df0] | std(sizeof=1, pointer=0x4ac0e40)
ft[sizeof=1, pointer=0x4ac0df1] | std(sizeof=1, pointer=0x4ac0e41)
ft[sizeof=1, pointer=0x4ac0df2] | std(sizeof=1, pointer=0x4ac0e42)
ft[sizeof=1, pointer=0x4ac0df3] | std(sizeof=1, pointer=0x4ac0e43)
ft[sizeof=1, pointer=0x4ac0df4] | std(sizeof=1, pointer=0x4ac0e44)
- - - -
lli
ft[ptr]=0x1fff0000f8 | std(ptr)=0x1fff0000f0
nmemb=5
size=8
ft[sizeof=1, pointer=0x4ac0e90] | std(sizeof=1, pointer=0x4ac0f00)
ft[sizeof=1, pointer=0x4ac0e91] | std(sizeof=1, pointer=0x4ac0f01)
ft[sizeof=1, pointer=0x4ac0e92] | std(sizeof=1, pointer=0x4ac0f02)
ft[sizeof=1, pointer=0x4ac0e93] | std(sizeof=1, pointer=0x4ac0f03)
ft[sizeof=1, pointer=0x4ac0e94] | std(sizeof=1, pointer=0x4ac0f04)
- - - -
ft[ptr]=0x1fff0000f8 | std(ptr)=0x1fff0000f0
nmemb=5
size=0
[FT] NULL.
[STD] NULL.
- - - -
ft[ptr]=0x1fff0000f8 | std(ptr)=0x1fff0000f0
nmemb=0
size=5
[FT] NULL.
[STD] NULL.
- - - -
ft[ptr]=0x1fff0000f8 | std(ptr)=0x1fff0000f0
nmemb=0
size=0
[FT] NULL.
[STD] NULL.



OK. All tests passed!
Time spent: 0.442633